{
  "metadata": {
    "compositionId": "PositiveThinkingTrap",
    "title": "긍정 사고의 함정",
    "language": "ko",
    "totalDuration": 210,
    "fps": 60,
    "createdAt": "2026-01-24"
  },
  "ttsSettings": {
    "provider": "openai",
    "voice": "alloy",
    "model": "tts-1-hd",
    "speed": 1.0
  },
  "scenes": [
    {
      "id": "intro",
      "title": "Intro/Hook",
      "startFrame": 0,
      "durationFrames": 720,
      "durationSeconds": 12,
      "text": "긍정적으로 생각하면 모든 게 잘 될 거야. 우리는 이 말을 수없이 들어왔습니다. 하지만 만약 이 말이 사실이 아니라면요? 만약 긍정적 사고가 문제를 해결하는 게 아니라, 오히려 문제를 은폐한다면요?"
    },
    {
      "id": "industry",
      "title": "긍정 사고 산업",
      "startFrame": 720,
      "durationFrames": 1200,
      "durationSeconds": 20,
      "text": "전 세계 자기계발 산업은 130억 달러가 넘습니다. 시크릿, 끌어당김의 법칙, 긍정 확언. 생각이 현실을 만든다는 메시지는 어디에나 있습니다. 자기계발서는 베스트셀러 목록을 점령하고, 기업들은 긍정 마인드셋 워크숍을 필수로 진행합니다. 하지만 이 모든 것이 과연 효과가 있을까요?"
    },
    {
      "id": "ehrenreich",
      "title": "Ehrenreich의 비판",
      "startFrame": 1920,
      "durationFrames": 1200,
      "durationSeconds": 20,
      "text": "저널리스트 바버라 에런라이크는 유방암 진단을 받은 후, 주변 사람들로부터 긍정적으로 생각하라는 조언을 끊임없이 들었습니다. 그녀는 분노했습니다. 왜 환자에게 긍정을 강요하는가? 이 경험은 그녀가 베스트셀러 브라이트-사이디드를 쓰는 계기가 되었습니다. 긍정 사고 문화에 대한 날카로운 비판입니다."
    },
    {
      "id": "toxic_positivity",
      "title": "독성 긍정성의 심리학",
      "startFrame": 3120,
      "durationFrames": 2400,
      "durationSeconds": 40,
      "text": "심리학 연구는 감정 억압의 역설을 보여줍니다. 대니얼 웨그너의 유명한 백곰 실험에서, 백곰을 생각하지 말라고 할수록 사람들은 더 많이 백곰을 떠올렸습니다. 감정도 마찬가지입니다. 괜찮아라고 말하며 부정적 감정을 억누르면, 그 감정은 더 강해집니다. 줄리 노렘 교수의 방어적 비관주의 연구에 따르면, 부정적 감정에도 중요한 정보적 가치가 있습니다. 불안은 위험을 경고하고, 슬픔은 상실을 처리하게 합니다. 억압하면 억압할수록, 감정은 증폭되어 결국 폭발하거나 번아웃으로 이어집니다."
    },
    {
      "id": "social_blame",
      "title": "사회적 책임의 개인화",
      "startFrame": 5520,
      "durationFrames": 2400,
      "durationSeconds": 40,
      "text": "더 심각한 문제가 있습니다. 긍정 사고 문화는 구조적 문제를 개인의 태도 문제로 전환합니다. 실업, 빈곤, 질병. 이것들이 과연 마음가짐의 문제일까요? 경제 불평등, 고용 불안정, 사회 안전망 부재. 이런 구조적 문제들이 존재하는데, 우리는 개인에게 긍정적으로 생각하지 않아서라고 말합니다. 기업이 대규모 구조조정을 하면서 동시에 긍정 마인드셋 워크숍을 진행하는 것. 이것은 사회적 책임 회피의 도구가 됩니다. 우주에 잘못된 신호를 보내서라는 말로, 시스템의 문제를 개인의 문제로 바꿔버립니다."
    },
    {
      "id": "alternative",
      "title": "균형 잡힌 대안",
      "startFrame": 7920,
      "durationFrames": 1800,
      "durationSeconds": 30,
      "text": "그렇다면 대안은 무엇일까요? 산드라 슈나이더 교수가 제안하는 현실적 낙관주의입니다. 근거 있는 희망과 현실적 위험 인식을 동시에 갖는 것입니다. 수용전념치료, ACT는 감정을 인정하고 가치 기반 행동으로 연결합니다. 개인의 노력과 구조적 변화, 둘 다 필요합니다. 진정한 회복력은 다 잘 될 거야가 아니라, 현실을 직시하고 행동하겠다에서 시작됩니다."
    },
    {
      "id": "outro",
      "title": "결론 및 마무리",
      "startFrame": 9720,
      "durationFrames": 2880,
      "durationSeconds": 48,
      "text": "긍정 사고 자체가 나쁜 것은 아닙니다. 문제는 긍정의 강요입니다. 부정적 감정을 억압하고, 구조적 문제를 무시하게 만드는 독성 긍정성입니다. 바버라 에런라이크의 말처럼, 현실을 직시하는 용기가 필요합니다. 긍정이 아닌 진실을, 희망이 아닌 행동을 선택하세요. 당신의 감정은 모두 유효합니다. 비판적으로 생각하고, 현실을 직시하세요. 그것이 진정한 회복력의 시작입니다."
    }
  ]
}
